app/Controllers/Dias.php


		}

		$dia = $this->diasModel->where('id', $id)->first();
---
SELECT *
FROM `dias`
WHERE `id` = '1'
 LIMIT 1