app/Controllers/Dias.php

	public function index()
	{

		setlocale(LC_TIME, 'es_ES.utf8', 'es_ES', 'esp');

		$datos = $this->diasModel->orderBy('fecha', 'DESC')->findAll(5);
---
SELECT *
FROM `dias`
ORDER BY `fecha` DESC
 LIMIT 5

	public function view($id)
	{

		$datos_dia = $this->diasModel->where('id', $id)->first();
		$lista_transacciones_dia = $this->viajesgastosModel->select('viajes_gastos.*, plataformas.descripcion as plataforma,
		categorias.subcategoria')
		->join('plataformas', 'viajes_gastos.plataforma_id = plataformas.id', 'left')
		->join('categorias', 'viajes_gastos.categoria_id = categorias.id', 'left')
		->where('viajes_gastos.dia_id', $id)->findAll();
---
SELECT *
FROM `dias`
WHERE `id` = '5'
 LIMIT 1
SELECT `viajes_gastos`.*, `plataformas`.`descripcion` as `plataforma`, `categorias`.`subcategoria`
FROM `viajes_gastos`
LEFT JOIN `plataformas` ON `viajes_gastos`.`plataforma_id` = `plataformas`.`id`
LEFT JOIN `categorias` ON `viajes_gastos`.`categoria_id` = `categorias`.`id`
WHERE `viajes_gastos`.`dia_id` = '1'

		$datos_dia->pendiente_meta = intval($datos_dia->meta) - intval($datos_dia->total_recaudado);

		$datos_dia->total_propinas = $this->viajesgastosModel->getTotalesAll('propina', null, null, 1, $id);
		$cantidad = $this->viajesgastosModel->select('COUNT(id) as cantidad')->where('dia_id', $id)->first();
---
SELECT COUNT(id) as cantidad
FROM `viajes_gastos`
WHERE `dia_id` = '5'
 LIMIT 1