app/Controllers/Viajesgastos.php

SELECT *
FROM `plataformas`
---
	public function new($id)
	{

	 		    $data = [
                'controller'    	=> 'viajes',
                'title'     		=> 'Nuevo Viaje',
				'plataformas'		=> $this->plataformasModel->findAll(),
				'dia_id'			=> $id
			];